// See https://aka.ms/new-console-template for more information
using System;

namespace Squid_Game
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /* Για την παραγωγή τυχαίων ακέραιων αριθμών που ξεκινά από το 1, καλώ την κλάση Random και φτιάχνω ένα αντικείμενο αυτής της κλάσης
               όπου θα ξεκινά η παραγωγή τυχαίων ακέραιων αριθμών από το 1 και θα φτάνει μέχρι το 12.*/
            Random rand = new Random();

            // Δημιουργώ ένα αντικείμενο (ζάρι) που θα παίρνει ως όρισμα ένα αντικείμενο τύπου Random και θα αναπαριστά έναν τυχαίο ακέραιο αριθμό από το 1-12.
            Dice dice = new Dice(rand);

            // Δημιουργία αντικειμένου τύπου SquidGame για την αλληλεπίδραση με τον χρήστη και θα ρίχνει το ζάρι.
            SquidGame squid = new SquidGame(dice);

            squid.StartGame();    // Για το αντικείμενο squid καλώ την μέθοδο StartGame(), για την υλοποίηση αυτής και την έναρξη του παιχνιδιού.

            Console.ReadKey();
        }
    }


    // Κλάση υπεύθυνη για το ρίξιμο του ζαριού.
    public class Dice
    {
        private Random _rand;   // Δημιουργία πεδίου τύπου Random (=>αντικείμενο της κλάσης Random).

        public Dice(Random rand)    // Δημιουργία κατασκευαστή και αρχικοποίηση του πεδίου.
        {
            _rand = rand;
        }

        // Δημιουργία μεθόδου, η οποία θα μού επιστρέφει κατά το ρίξιμο του μαγικού ζαριού, τον επόμενο τυχαίο ακέραιο αριθμό που θα παραχθεί.
        public int DiceRoll()
        {
            /* Επιστροφή του επόμενου τυχαίου ακέραιου αριθμού για το αντικείμενο τύπου Random καλώντας την μέθοδο Next και βάζοντας ως πρώτο όρισμα τον αριθμό 1 
             * που από εκεί θα ξεκινά η επιστροφή του αριθμού από το μαγικό ζάρι και θα φτάνει μέχρι το n-1, δηλαδή μέχρι το 12, καθώς το 13 δεν συμπεριλαμβάνεται.
             */
            return _rand.Next(1, 13);   
        }

    }   // Εδώ τελειώνει η κλάση Dice.


    // Κλάση υπεύθυνη για την διάδραση με τον χρήστη.
    public class SquidGame
    {
        private Dice _dice;     // Δημιουργία του πεδίου που είναι το ζάρι.
        /* Η σταθερά _totalNumberOfTries (δεν μπορεί να αλλάξει η τιμή μετά την αρχική ανάθεση), αντιπροσωπεύει τον standard αριθμό των προσπαθειών που έχει ένας παίκτης 
         * στο παιχνίδι και είναι 4 οι προσπάθειες που έχει.*/
        private const int _totalNumberOfTries = 4;

        // Δημιουργία κατασκευαστή, για αρχικοποίηση του πεδίου.
        public SquidGame(Dice dice)
        {
            _dice = dice;
        }


        // Μέθοδος για την εκκίνηση του παιχνιδιού, ρίξιμο ζαριού και παροχής κατάλληλου feedback στον χρήστη. 
        public void StartGame()   
        {
            // Για το πεδίο _dice αποκτώ πρόσβαση στην μέθοδο DiceRoll() => η οποία μού επιστρέφει τον επόμενο τυχαίο ακέραιο αριθμό από το 1-12 και εκχωρείται
            // στην μεταβλητή GameTarget, που θα περιέχει τον τυχερό αριθμό.
            int GameTarget = _dice.DiceRoll();

            // Ενημέρωση του χρήστη ότι έχει 4 προσπάθειες για να βρει τον τυχερό αριθμό.
            Console.WriteLine("Magic Dice is rolled. Try to find what number it is in 4 tries.");

            /* Σε αυτή την μεταβλητή (numberOfTriesLeft) θα κρατάω τον αριθμό των εναπομείναντων προσπαθειών από τον χρήστη,
            για αυτό και εκχωρώ την σταθερά (_totalNumberOfTries) μέσα στην μεταβλητή αυτή, η οποία περιέχει τις 4 σίγουρες προσπάθειες που έχει ο χρήστης.*/
            int numberOfTriesLeft = _totalNumberOfTries;    

            while(numberOfTriesLeft > 0)    // Για όσο οι προσπάθειες που έχουν απομείνει στον χρήστη είναι > 0.
            {
                Console.Write("Please insert your number: ");   // Ζητάω από τον χρήστη την εισαγωγή ενός αριθμού.
                string userInput = Console.ReadLine();
                if (!int.TryParse(userInput, out int numberOfGuess))    // Προσπάθεια μετατροπής του αριθμού σε ακέραιο και εξαγωγή αυτού στην μεταβλητή numberOfGuess.
                {
                    Console.WriteLine("Please insert numeric values only!");    // Στην περίπτωση που ο χρήστης έχει εισάγει string τότε ενημερώνεται ότι θα πρέπει να εισάγει μόνο αριθμητικές τιμές και του ζητείται να εισάγει ξανά αριθμό.
                    continue;   // Οι παρακάτω εντολές παρακάμπτονται και συνεχίζεται να εκτελείται ο τρέχον βρόγχος με το να ζητάει από τον χρήστη να εισάγει έναν αριθμό.
                }
                if(numberOfGuess < 1 || numberOfGuess > 12)   // Σε δεύτερο έλεγχο τσεκάρω εάν ο αριθμός είναι μεταξύ 1 εώς 12, ειδάλλως εάν το ένα από τα 2 σκέλη της συνθήκης μού δώσει αποτέλεσμα true, τότε μπαίνω μέσα στην if και ζητάω από τον χρήστη να μού εισάγει ξανά αριθμό και συνεχίζεται η ροή του προγράμματος χωρίς να μειώνονται οι προσπάθειες. 
                {
                    Console.WriteLine("Invalid input! Please try again by inserting your number from 1 to 12!");
                    continue;   // Συνεχίζεται να εκτελείται η τρέχουσα επανάληψη, χωρίς να μειώνονται οι προσπάθειες, καθώς οι παρακάτω εντολές παρακάμπτονται και δεν μειώνεται το numberOfTriesLeft, στην περίπτωση που η είσοδος είναι αριθμός εκτός εύρους (μικρότερος του 1 ή μεγαλύτερος του 12).
                }
                if (numberOfGuess == GameTarget)    // Εάν ο αριθμός που έχει δώσει ο χρήστης κατά την είσοδο ισοδυναμεί με τον τυχερό αριθμό που βρίσκεται μέσα στην μεταβλητή GameTarget, τότε ο χρήστης ενημερώνεται ότι κέρδισε το παιχνίδι. 
                {
                    Console.WriteLine("Well done! You Won the game!");
                    return;     // Εδώ τερματίζεται η εκτέλεση του προγράμματος, καθώς δεν θα εκτελεστούν οι παρακάτω εντολές, γιατί ο χρήστης κέρδισε το παιχνίδι.
                }
                else
                {
                    numberOfTriesLeft--;    // Μείωση των προσπαθειών που έχουν απομείνει στον χρήστη κατά 1.
                if (numberOfTriesLeft > 0)   // Εδώ ελέγχω εάν ο αριθμός των εναπομείναντων προσπαθειών του χρήστη είναι > 0 τότε τον ενημερώνω ότι ήταν λάθος η μαντεψιά του και τον ενημερώνω για το πόσες προσπάθειες του έχουν απομείνει. Εάν από την συνθήκη πάρω false (που σημαίνει ότι ο χρήστης δεν έχει άλλες προσπάθειες και οι εναπομείναντες προσπάθειες είναι 0, τότε δεν υλοποιείται το σώμα της if και βγαίνω και από τον επαναληπτικό βρόγχο και δεν ζητάω αριθμό από τον χρήστη, καθώς δεν έχει άλλες προσπάθειες.
                {
                    Console.WriteLine($"Wrong Guess! Try again! You have {numberOfTriesLeft} tries left!");
                }
                }
            }
            // Ενημέρωση του χρήστη ότι έχασε το παιχνίδι και ενημέρωσή του για το ποιος ήταν ο τυχερός κρυφός αριθμός, που φυλάσσεται μέσα στην μεταβλητή GameTarget.
            Console.WriteLine($"You lost the game! The correct number was {GameTarget}!"); 
        }
    }   // Εδώ τελειώνει η κλάση SquidGame.
}
